using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DataType
{
    class Program
    {
        static void Main(string[] args)
        {
            //نوع البيانات DataType
            /*
       - byte = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة فقط
       - sbyte = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة او السالبة
       - short = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة او السالبة
       - ushort = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة فقط
       - int = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة او السالبة
       - uint = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة فقط
       - long = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة او السالبة
       - ulong = هذا النوع يتم استخدامه للارقام الصحيحة الموجبة فقط
       - float = هذا النوع يتم استخدامه للارقام الصحيحة و العشرية الموجبة او السالبة
       - double = هذا النوع يتم استخدامه للارقام الصحيحة والعشرية الموجبة او السالبة
       - decimal = هذا النوع يتم استخدامه للارقام الصحيحة و العشرية الموجبة او السالبة
       - char = هذا النوع يتم استخدامه لحرف واحد فقط
       - string = هذا النوع يتم استخدامه لسلسة من الحروف المتتالية نص كامل
       - bool = هذا النوع يتم استخدامه لشيء منطقي نعم او لا
       - object = هذا النوع يتم استخدامه لاي شيء
     
          */
         
        }
    }
}
